Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Делимое - целое числовое выражение,
en: Dividend - integer numerical expression.

source: Делитель - целое числовое выражение.
en: Divisor - integer numerical expression.

source: Делитель:
en: Divisor:

source: День - день в виде числа,
en: Day - day in the form of a number.

source: День - день в виде числа.
en: Day - day in the form of a number.

source: День недели
en: Day of week

source: День недели.
en: Day of the week.

source: Дерево данных
en: Data Tree

source: Дерево моделей, в котором отображаются созданные алгоритмом модели в процессе обучения.
en: The tree of models in which the models created by the algorithm in the training process are displayed.

source: Дерево узлов имеет как минимум две корневые ветки:
en: The nodes tree has, at least, two root branches:

source: Дерево — это структура данных в виде набора связанных узлов.
en: Tree: the data structure in the form of a set of connected nodes.

source: Детализация использует данные исходного набора данных, отфильтрованные по выделенным в основной таблице кластерам.
en: Detailing uses the data of the source data set filtered by the clusters selected in the main table.

source: Детализация позволяет узнать из каких строк исходного набора данных состоит тот или иной кластер.
en: Detailing enables to find out what rows of the source data set are included into this or that cluster.

source: Детализация поможет выяснить, из каких записей образуется конкретный факт.
en: Detailing enables to find out from which records the given measure is generated.

source: Детальные настройки
en: Detailed Settings

source: Детальные настройки объединяются в следующие блоки параметров:
en: Detailed settings are joined into the following packs of parameters:

source: Диаграмма IV может отображать:
en: Chart IV can display as follows:

source: Диаграмма Куба представляет собой диаграмму заданного типа, построенную на основе Куба, но в отличие от обычной, она однозначно соответствует текущему состоянию Куба и при любых его изменениях меняется соответственно.
en: The Cube chart represents the chart of the given type constructed on the Cube basis. As opposed to the standard one, it clearly matches the current state of the Cube, and in the case of all its changes, it changes correspondingly.

source: Диаграмма визуально отображает зависимость значений одного поля от другого.
en: The chart visually shows dependence of values of one field on the other one.

source: Диаграмма куба имеет свою собственную Панель инструментов, которая содержит следующие кнопки:
en: The cube chart has its own Toolbar that contains the following buttons:

source: Диаграмма начальных классов может представлять:
en: Fine classes chart can be as follows:

source: Диаграмма размаха;
en: Box plot;

source: Диаграммы Количество и Доля переключаются между собой кнопками .
en: buttons are used to switch Count and Rate charts.

source: Диапазон значений от $$0$$ до $$1.8*10^{308}$$.
en: Range of values varies from $$0$$ to $$1.8*10^{308}$$.

source: Диапазон изменения значений от 1 до 4.
en: Range of values change varies from 1 to 4.

source: Динамика.
en: Dynamics.

source: Дискретное разбиение
en: Discrete binning

source: Дискретный.
en: Discrete

source: Дискретными могут быть и числовые данные, например, "Код товара", принимающий значение целого типа, является дискретным, так как арифметические операции над этим показателем не имеют смысла.
en: The numeric data can be also discrete, for example, "Article code" that takes the integer value is discrete as arithmetic operations with this indicator are meaningless.

source: Дискретными являются все данные строкового или логического типа.
en: All string or logical data is discrete.

source: Длина - длина подстроки
en: Length - the substring length.

source: Длина - длина удаляемой подстроки
en: Length - length of the deleted substring.

source: Длительность выполнения мутации пользователем не контролируется.
en: Duration of the mutation performed by a user is not controlled.

source: Для Аутентификации используется введенное на стартовой странице Loginom имя и пароль пользователя:
en: The user name and password entered on the Loginom home page are used for Authentification:

source: Для Подмодели можно задать произвольное количество входных/выходных портов следующих типов:
en: It is possible to set the random number of the following input/output ports for the Supernode:

source: Для Списка входных столбцов доступна операция Скрыть боковую панель.
en: For the List of input columns Hide side bar operation is available.

source: Для FNR используют также обозначение 1 - Чувствительность. $$\displaystyle\mathsf{FNR=\frac{FN}{P}=\frac{FN}{FN+TP}=1−TPR}$$.
en: For FNR 1 - Sensitivity. term is frequently used $$\displaystyle\mathsf{FNR=\frac{FN}{P}=\frac{FN}{FN+TP}=1−TPR}$$.

source: Для FPR используют также обозначение 1 - Специфичность. $$\displaystyle\mathsf{FPR=\frac{FP}{N}=\frac{FP}{FP+TN}=1−TNR}$$.
en: For FPR 1 - Specificity.term is frequently used $$\displaystyle\mathsf{FPR=\frac{FP}{N}=\frac{FP}{FP+TN}=1−TNR}$$.

source: Для Строкового типа порядок к максимуму такой: "Пустое значение → Символы → Цифры → латинский алфавит в нижнем регистре → Латинский в верхнем → Русский в нижнем → Русский в верхнем регистре".| | Среднее||•|•||||Выводит среднее значение всех ячеек столбца.
en: For String type the order to maximum is as follows: "Null value → Characters → Digits → the lowercase Latin alphabet → the uppercase Latin alphabet → the lowercase Russian alphabet → the uppercase Russian alphabet".| | Average||•|•||||It shows the average value of all column cells.

source: Для Active Directory это обычно sAMAccountName, а для OpenLDAP uid.
en: It is generally sAMAccountName for Active Directory, and uid for OpenLDAP.

source: Для ClickHouse — двойные кавычки.
en: Double quotes are used for ClickHouse.

source: Для Desktop-версии указывается абсолютный путь.
en: The absolute path is specified for the Desktop version.

source: Для Firebird – двойные кавычки.
en: Double quotes are used for Firebird.

source: Для Firebird — двойные кавычки.
en: Double quotes are used for Firebird.

source: Для Interbase – двойные кавычки.
en: Double quotes are used for Interbase.

source: Для MS SQL — квадратные скобки.
en: Square brackets are used for MS SQL.

source: Для Microsoft Access — квадратные скобки;
en: Square brackets are used for Microsoft Access.

source: Для Microsoft Excel — двойные кавычки;
en: Double quotes are used for Microsoft Excel.

source: Для MySQL — обратные апострофы.
en: Backquotes are used for MySQL.

source: Для ODBC символы обрамляющих кавычек определяются автоматически;
en: The framing quotes characters are automatically defined for ODBC.

source: Для Oracle — двойные кавычки.
en: Double quotes are used for Oracle.

source: Для PostgreSQL — двойные кавычки.
en: Double quotes are used for PostgreSQL.

source: Для SQLite — двойные кавычки.
en: Double quotes are used for SQLite.

source: Для Даты/Времени используется подмножество форматов ISO 8601: "YYYY-MM-DD", "YYYY-MM-DDThh:mm[:ss.zzz]", "hh:mm[:ss.zzz]".
en: Subset of ISO 8601 formats is used for Date/Time: "YYYY-MM-DD", "YYYY-MM-DDThh:mm[:ss.zzz]", "hh:mm[:ss.zzz]".

source: Для алгоритмов, которые не поддерживают обработку фактов, в этом поле будет только одна финальная модель.
en: Only one final model will be available in this field for the algorithms that do not support processing of measures.

source: Для аналитика данный раздел доступен по умолчанию| |Вход в интерактивном режиме|Отмечает разрешение на режим входа через браузер| |Вход в режиме службы|Отмечает разрешение на вход в режиме службы (для запуска сервера)| |Полный доступ к файловому хранилищу|Отображает наличие у пользователя полного доступа к файловому хранилищу, в ином случае только к личным и общим папкам| |Заблокировать учётную запись|Отображает заблокирован ли пользователь в системе|
en: This section is accessible for an analyst by default| |Enter in the interactive mode|It checks whether it is permitted to use the enter mode via browser| |Enter in the service mode|It checks whether it is permitted to enter in the service mode (for the server start)| |File storage full access|It displays whether a user has full access to the file storage, otherwise, only to the personal and shared folders| |Block account|It displays whether a user is blocked in the system|

source: Для быстрой сортировки по столбцу нужно нажать на его заголовок.
en: To perform quick sorting by column, it is required to press its caption.

source: Для ввода новой строки в таблице замены используется кнопка Добавление строки.
en: To enter the new row into the replacement table, it is required to use Add row button.

source: Для ввода новой строки в таблице замены используется кнопка добавить.
en: To enter the new row to the replacement table, it is required to use add button.

source: Для вейвлета Добеши этот параметр может принимать значения от 1 до 10, для койфлетов - от 1 до 5, вейвлетом CDF 9/7 этот параметр не используется.
en: For the Daubechies wavelet this parameter can take values from 1 to 10, for the Coiflet wavelet - from 1 to 5, and this parameter is not used by CDF 9/7 wavelet.

source: Для включения режима редактирования используется кнопка Редактировать разбиение.
en: To enable the editing mode, Edit binning button is used.

source: Для всех методов квантования можно установить флаг Округлять границы.
en: It is possible to select Round limits checkbox for all binning methods.

source: Для всех моделей.
en: For all models.

source: Для вступления в силу изменений ряда параметров требуется перезагрузка службы сервера.
en: The changes of some parameters take effect after the server service restart.

source: Для входного порта уникальность должна быть соблюдена в рамках списка входных портов, для выходного — в рамках списка выходных портов.
en: It is required to provide uniqueness of the input port in the list of the input ports, for the output port - in the list of the output ports.

source: Для выбора синтаксиса необходимо в меню списка выражений выбрать JavaScript или Выражение (см.
en: To select the syntax, it is required to select JavaScript or Expression in the expressions list menu (refer to

source: Для выбора формата отображения поля необходимо щёлкнуть левой кнопкой мыши рядом с нужным полем и выбрать один из доступных вариантов из выпадающего списка.
en: To select the field display format, it is required to click near the required field with the left mouse button and select one of the available options fom the drop-down list.

source: Для вывода результата в вычисляемое поле калькулятора используется команда return, которая возвращает значение переменной result, содержащей вычисленную сумму полей Калькулятора.
en: To show the result in the calculated calculator field, it is required to use the return command that returns the result variable value which contains the calculated sum of the Calculator fields.

source: Для вывода результата скрипта в вычисляемое поле калькулятора используется команда return pow(COL1, COL2), где pow(COL1, COL2) — вызов объявленной функции с передачей параметрам х и n значений из полей (или переменных) калькулятора COL1 и COL2 соответственно.
en: To show the script result in the calculated calculator field, it is required to use return pow(COL1, COL2) command where pow(COL1, COL2) enables to call the declared function with transfer to х and n parameters of the values from the calculator fields (or variables) COL1 and COL2, correspondingly.

source: Для выделения нескольких элементов можно:
en: There are the following ways to select several items:

source: Для вызова контекстного меню порта необходимо кликнуть мышью порт.
en: To call the context menu of the port, it is required to click on the port.

source: Для выполнения команд через cmd.exe необходимо указывать соответствующие ключи:
en: To run commands using cmd.exe, it is required to state the following keys:

source: Для дальнейшего увеличения масштаба данную процедуру можно повторить.
en: The procedure is to be repeated to zoom in again.

source: Для дальнейшей настройки необходимо проставить связи между полями и параметрами, сделать это можно несколькими способами:
en: It is required to establish the links between fields and parameters for provide further setup. It can be done in several ways:

source: Для данного способа слияния порядок таблиц не важен.
en: The order of tables is not important for this join method.

source: Для диаграммы IV:
en: For chart IV:

source: Для диаграммы WoE:
en: For WoE chart:

source: Для дискретного разбиения
en: For the discrete binning

source: Для дискретных данных строка внешнего разбиения соответствует одному уникальному значению поля основного источника данных.
en: In the case of the discrete data, the external binning string maps one unique field value of the main data source.

source: Для добавления данного поля следует выставить соответствующий флаг в мастере настройки.
en: To add this field, it is required to select corresponding checkbox in the wizard.

source: Для добавления отчета в определенную группу необходимо выбрать визуализатор и открыть выпадающий список рядом с меню Добавить в отчеты.
en: To add the report to the definite group, it is required to select the visualizer and open the drop-down list near Add to reports menu.

source: Для доступа к входным переменным используется объект InputVariables.
en: For access to the input variables, the InputVariables object is used.

source: Для доступа к данным выходного порта используется объект OutputTable.
en: For access to the output port data, the OutputTable object is used.

source: Для доступа к данным портов Входной источник данных[N] используются объекты InputTables[] и InputTable.
en: For access to the data of Input data source[N] ports, InputTables[] and InputTable objects are used.

source: Для доступа к данным портов и другим встроенным объектам в контексте выполнения JavaScript-кода предусмотрены следующие объекты:
en: To have access to the data of ports and other built-in objects in the context of the JavaScript code execution, the following objects are provided:

source: Для дочерних узлов есть возможность создать узлы того же иерархического уровня.
en: It is possible to create nodes of the same hierarchic level for child nodes.

source: Для его отображения/сворачивания используются кнопки и .
en: and buttons are used to display/collapse it.

source: Для его преобразования в табличный вид предназначен компонент Извлечение XML.
en: XML Extraction component is designated for its transformation to the table form.

source: Для заключения узла в цикл следует отметить его радиокнопкой и перейти к следующему шагу.
en: To loop the node, it is required to mark it with the radio button and go to the next step.

source: Для заполнения выходного набора в коде возможно использование данных входных портов.
en: To append the output data set, it is possible to use the data of the input ports in the code.

source: Для запуска пакетного выполнения по расписанию можно использовать сторонний планировщик заданий, например, планировщик заданий Windows.
en: To launch the batch processing according to schedule, it is possible to use the external job scheduler, for example, Windows job scheduler.

source: Для значений входного поля применяются параметры настроенного внешнего разбиения.
en: Parameters of the configured external binning are used for the input field values.

source: Для избежания повторных вычислений существует возможность сохранения промежуточных расчетов в памяти (см.
en: To avoid repeated calculations, it is possible to save the intermediate calculations in memory (refer to

source: Для импорта модуля CommonJS применяется функция require.
en: To import the CommonJS module, it is required to use require function.

source: Для исключения из списка сортируемых полей нужно:
en: It is required to perform the following actions to exclude from the list of sorted fields:

source: Для исключения конфликтов используется следующий приоритет:
en: To exclude conflicts, the following priority is observed:

source: Для исключения сортировки по полю:
en: To exclude sorting by the field, it is required to perform the following actions:

source: Для исключения элемента из списка выбранных:
en: To exclude the item from the list of selected items, it is required to perform the following actions:

source: Для использования внешнего разбиения, таблица должна быть сформирована определенным образом:
en: To use the external binning, it is required to create the table in a certain manner:

source: Для их определения и исключения из частых наборов задается:
en: The following parameters are set for their determination and exclusion:

source: Для их подсчета нужно нажать на соответствующие кнопки.
en: To calculate them, it is required to press corresponding buttons.

source: Для каждого из параметров можно задать либо автоматическую установку значения, либо ввести необходимое значение вручную.
en: It is possible either to select auto setup of value for each of parameters, or to enter the required value in the manual way.

source: Для каждого из полей можно выбрать один из вариантов назначения:
en: It is required to select one of the following usage types for each of the fields:

source: Для каждого из столбцов можно выбрать один из вариантов назначения:
en: It is required to select one of the following usage types for each of the columns:

source: Для каждого количества отсчетов впоследствии вычисляется коэффициент автокорреляции.
en: The autocorrelation coefficient is further calculated for each lag count.

source: Для каждого модуля в составе пакета можно настроить свой список подключений.
en: A separate list of connections can be set for each module included into the package.

source: Для каждого поля из "Набора 1", отмеченного флагом, будут вычислены коэффициенты корреляции с полями, отмеченными флагами в "Наборе 2".
en: For each field from "Set 1" selected with a checkbox, correlation coefficients with the fields selected with checkboxes in "Set 2" will be calculated.

source: Для каждого поля исходного набора данных критерии определения выбросов и экстремальных значений задаются пользователем с помощью указания допустимого стандартного отклонения или интерквартильного размаха.
en: A user sets criteria of outliers and extreme values determination for each field of the source data set by specifying the allowable standard deviation or interquartile range.

source: Для каждого поля исходного набора задается способ замены:
en: Replacement method is set for each field of the source data set:

source: Для каждого поля можно выставить флаг, задающий необходимость обработки, и затем выставить метод заполнения пропусков.
en: It is possible to select the checkbox that enables to define the processing necessity for each field. Then, it is possible to set the imputation method.

source: Для каждого поля можно выставить флаг, определяющий наличие обработки, и затем, выделив поле, задать метод редактирования.
en: It is possible to select the checkbox that enables to define the processing avialability for each field. Upon selection of the field, it is possible to set the processing method.

source: Для каждого поля спектр доступных методов определяется тремя характеристиками данных одновременно (см.
en: The spectrum of available methods is defined for each field by three data characteristics simultaneously (refer to

source: Для каждого столбца исходного набора данных пользователь может выбрать наиболее подходящий метод заполнения пропусков.
en: A user can select the most suitable imputation method for each column of the source data set.

source: Для каждой группы возвращается одна строка.
en: One string is returned for each group.

source: Для каждой группы записей сформируется XML.
en: XML will be generated for each group of records.

source: Для каждой из них создается отдельный метод SOAP-сервиса и URL REST-сервиса.
en: A separate method of SOAP service and URL REST service is created for each of them.

source: Для категориальных полей, если каждый класс формируется для отдельной категории, то в качестве метки указывается эта категория.
en: For categorical fields: if each class is generated for a separate category, it is required to specify this category as a caption.

source: Для категориальных признаков верхняя граница обозначается двумя категориями – нижней категорией следующего класса и верхней категорией текущего.
en: The upper bound is denoted by two categories for categorical indicators, namely, the lower category of the next class and the upper category of the current class.

source: Для категориальных признаков нижняя граница обозначается двумя категориями – верхней категорией предыдущего класса и нижней категорией текущего.
en: The lower bound is denoted by two categories for categorical indicators, namely, the upper category of the previous class and the lower category of the current class.

source: Для классификатора также по умолчанию включен Останов при нулевой ошибки классификации:
en: By default, Stop at zero classification error is also enabled for the classifier:

source: Для конечного же пользователя предназначена панель отчетов.
en: The reports panel is designated for the end user.

source: Для корректной работы Deductor Warehouse обязательным требованием является полноценная поддержка базой данных стандарта SQL'92, поэтому имеются ограничения на версии СУБД:
en: For proper operation of Deductor Warehouse, it is compulsory to provide the full-scale database support of SQL'92 standard. That is why there are constraints concerning the DBMS versions:

source: Для моделей ARIMA нормализация для прогнозируемых данных обычно не требуется.
en: Normalization is not usually required for the forecast data for the ARIMA models.

source: Для настройки видимости узла необходимо установить соответствующий модификатор доступа.
en: To configure the node visibility, it is required to install corresponding Access modifier.

source: Для настройки доступа следует сделать по выбранному объекту клик правой кнопкой мыши и в контекстном меню выбрать пункт "Настроить модификатор доступа".
en: To provide the accessibility setup, it is required to click on the selected object with the right mouse button and select "Configure visibility" option in the context menu.

source: Для настройки доступны следующие параметры:
en: The following parameters can be configured:

source: Для настройки сортировки необходимо переместить требуемые поля в список Поля сортировки.
en: To configure sorting, it is required to move the necessary fields to Sort fields list.

source: Для настройки сортировки, необходимо переместить требуемые поля в список Поля сортировки при помощи:
en: To configure sorting, it is required to move the required fields to the Sort fields list using the following methods:

source: Для настройки требуется переместить поля входного набора в списки Группа или Показатели, перетаскивая их мышью.
en: To configure, it is required to move the input data set fields to the Group or Parameters lists, dragging them with the mouse.

source: Для настройки требуется переместить поля входного набора в списки Информационные или Транспонируемые, перетаскивая их мышью.
en: To configure, it is required to move the input data set fields to the Info or Transposed lists, dragging them with the mouse.

source: Для начала оценки и корректировки результатов формирования начальных и конечных классов необходимо нажать на кнопку Активировать, расположенную справа от поля Состояние входа.
en: To start assessment and adjustment of results of fine and coarse classes generation, it is required to press Activate button that is located to the right from Input status field.
